In [1]:
import numpy as np
import pandas as pd

In [112]:
df = pd.read_csv('input_data.csv')

In [119]:
df

    id  dataPoints
0    0        72.0
1    1        69.0
2    2        83.0
3    3        70.0
4    4        78.0
..  ..         ...
95  95        99.0
96  96        61.0
97  97        79.0
98  98        99.0
99  99        99.0

[100 rows x 2 columns]

In [120]:
df.fillna(value = 0,
          inplace = True)
df = df.replace(np.inf, 1)
df = df.replace(-np.Inf, -1)
df

    id  dataPoints
0    0        72.0
1    1        69.0
2    2        83.0
3    3        70.0
4    4        78.0
..  ..         ...
95  95        99.0
96  96        61.0
97  97        79.0
98  98        99.0
99  99        99.0

[100 rows x 2 columns]

In [122]:
def squqreroot(x):
    if x == 0.0 and x == -1.0 and x == 1.0:
        return x
    else:
        return np.sqrt(x)

In [124]:
df['sqrt'] = df['dataPoints'].apply(squqreroot)

In [125]:
df.fillna(value = -1,
          inplace = True)
df[15:60]

    id  dataPoints      sqrt
15  15        61.0  7.810250
16  16        66.0  8.124038
17  17         0.0  0.000000
18  18        -1.0 -1.000000
19  19        -1.0 -1.000000
20  20        93.0  9.643651
21  21        63.0  7.937254
22  22        63.0  7.937254
23  23        86.0  9.273618
24  24        94.0  9.695360
25  25        -1.0 -1.000000
26  26         1.0  1.000000
27  27        -1.0 -1.000000
28  28         1.0  1.000000
29  29        72.0  8.485281
30  30        58.0  7.615773
31  31        74.0  8.602325
32  32        -1.0 -1.000000
33  33        78.0  8.831761
34  34         0.0  0.000000
35  35        91.0  9.539392
36  36        88.0  9.380832
37  37        -1.0 -1.000000
38  38        63.0  7.937254
39  39         1.0  1.000000
40  40        82.0  9.055385
41  41        51.0  7.141428
42  42         1.0  1.000000
43  43        75.0  8.660254
44  44        -1.0 -1.000000
45  45        82.0  9.055385
46  46        55.0  7.416198
47  47        -1.0 -1.000000
48  48        82.0  9.055385
49  49        97.0  9.848858
50  50         0.0  0.000000
51  51        55.0  7.416198
52  52        58.0  7.615773
53  53        88.0  9.380832
54  54        53.0  7.280110
55  55         1.0  1.000000
56  56        54.0  7.348469
57  57        95.0  9.746794
58  58        57.0  7.549834
59  59         1.0  1.000000

In [126]:
df['sqrt'] = df['sqrt'].round(2)

In [127]:
df.drop(columns=['dataPoints'], inplace = True)

In [128]:
df.rename(columns={'sqrt':'dataPoints'},inplace=True)

In [129]:
df

    id  dataPoints
0    0        8.49
1    1        8.31
2    2        9.11
3    3        8.37
4    4        8.83
..  ..         ...
95  95        9.95
96  96        7.81
97  97        8.89
98  98        9.95
99  99        9.95

[100 rows x 2 columns]

In [131]:
df.to_csv('output_data.csv',sep=',',index=False)

In [132]:
df = pd.DataFrame({
  "Accessories": ["Laptop", "Laptop", "Ipad", "Ipad", "Tablet", "Laptop"],
  "customer": ["Andrew", "Andrew", "Tom", "Andrew", "Tobey", "Peter"],
  "quantity": [1, 2, 2, 3, 1, 2],
})

In [133]:
df

  Accessories customer  quantity
0      Laptop   Andrew         1
1      Laptop   Andrew         2
2        Ipad      Tom         2
3        Ipad   Andrew         3
4      Tablet    Tobey         1
5      Laptop    Peter         2

In [134]:
df.pivot_table(index="Accessories", columns="customer", values="quantity", aggfunc=np.sum)

customer     Andrew  Peter  Tobey  Tom
Accessories
Ipad            3.0    NaN    NaN  2.0
Laptop          3.0    2.0    NaN  NaN
Tablet          NaN    NaN    1.0  NaN

In [137]:
df.groupby(['Accessories', 'customer']).quantity.sum().unstack()

customer     Andrew  Peter  Tobey  Tom
Accessories
Ipad            3.0    NaN    NaN  2.0
Laptop          3.0    2.0    NaN  NaN
Tablet          NaN    NaN    1.0  NaN

In [138]:
df.set_index(["Accessories", "customer"])["quantity"].unstack()

ValueError: Index contains duplicate entries, cannot reshape

In [139]:
df.pivot_table(index="Accessories", columns="customer", values="quantity", aggfunc=np.sum, fill_value=0)

customer     Andrew  Peter  Tobey  Tom
Accessories
Ipad              3      0      0    2
Laptop            3      2      0    0
Tablet            0      0      1    0

In [140]:
df = pd.DataFrame({
 "A":['tst1','tst2','tst3','tst3'],
 "B":[5, 6, 7, 8],
 "C":[9, 10, 11 ,12],
 "D":[13, 14, 15, 16]
})
df

      A  B   C   D
0  tst1  5   9  13
1  tst2  6  10  14
2  tst3  7  11  15
3  tst3  8  12  16

In [146]:
df.melt(id_vars =['A'], value_vars = ['B', 'C'],var_name ='St_name', value_name ='Scores')

      A St_name  Scores
0  tst1       B       5
1  tst2       B       6
2  tst3       B       7
3  tst3       B       8
4  tst1       C       9
5  tst2       C      10
6  tst3       C      11
7  tst3       C      12

In [157]:
df = pd.DataFrame({'A':['21-02-2020']})

In [158]:
df

            A
0  21-02-2020

In [159]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1 entries, 0 to 0
Data columns (total 1 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       1 non-null      object
dtypes: object(1)
memory usage: 136.0+ bytes

In [160]:
df["A"]= df["A"].astype("datetime64")

In [154]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1 entries, 0 to 0
Data columns (total 1 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       1 non-null      datetime64[ns]
dtypes: datetime64[ns](1)
memory usage: 136.0 bytes

In [155]:
df["age"] = pd.to_datetime("today").year - df["A"].dt.year

In [156]:
df

           A  age
0 2020-02-21    2

In [162]:
df["age"] = 2022-df["A"].year

AttributeError: 'Series' object has no attribute 'year'

In [163]:
A = [56, 92, 29, 93, 55, 32]
B = ['2021-01-01', '2021-02-12', '2021-04-16', '2021-01-22', '2021-01-15', '2021-02-26']

In [164]:
A

[56, 92, 29, 93, 55, 32]

In [165]:
B

['2021-01-01',
 '2021-02-12',
 '2021-04-16',
 '2021-01-22',
 '2021-01-15',
 '2021-02-26']

In [167]:
df = pd.DataFrame({'reg_id':A, 'reg_dates':B})
df

   reg_id   reg_dates
0      56  2021-01-01
1      92  2021-02-12
2      29  2021-04-16
3      93  2021-01-22
4      55  2021-01-15
5      32  2021-02-26

In [168]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 2 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   reg_id     6 non-null      int64
 1   reg_dates  6 non-null      object
dtypes: int64(1), object(1)
memory usage: 224.0+ bytes

In [171]:
df['reg_dates'] = pd.to_datetime(df['reg_dates'])

In [172]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 2 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   reg_id     6 non-null      int64
 1   reg_dates  6 non-null      datetime64[ns]
dtypes: datetime64[ns](1), int64(1)
memory usage: 224.0 bytes

In [173]:
df

   reg_id  reg_dates
0      56 2021-01-01
1      92 2021-02-12
2      29 2021-04-16
3      93 2021-01-22
4      55 2021-01-15
5      32 2021-02-26

In [174]:
df['reg_dates'].dt.year

0    2021
1    2021
2    2021
3    2021
4    2021
5    2021
Name: reg_dates, dtype: int64

In [175]:
df['reg_dates'].dt.month

0    1
1    2
2    4
3    1
4    1
5    2
Name: reg_dates, dtype: int64

In [176]:
df['reg_dates'].dt.day

0     1
1    12
2    16
3    22
4    15
5    26
Name: reg_dates, dtype: int64

In [1]:
import pandas as pd

In [19]:
df = pd.DataFrame({'Date':["2015-12-06", "2011-12-27", "2015-09-07", "2012-12-21", "2020-02-13", "2015-06-09"], 'RID':[498, 721, 375, 464, 813, 853], 'Phy':[22, 45, 1, 65, 22, 17], 'Chem':[52, 56, 32, 50, 24, 61], 'Math':[63, 37, 68, 62, 43 ,42]})

In [25]:
df

        Date  RID  Phy  Chem  Math
0 2015-12-06  498   22    52    63
1 2011-12-27  721   45    56    37
2 2015-09-07  375    1    32    68
3 2012-12-21  464   65    50    62
4 2020-02-13  813   22    24    43
5 2015-06-09  853   17    61    42

In [26]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Date    6 non-null      datetime64[ns]
 1   RID     6 non-null      int64
 2   Phy     6 non-null      int64
 3   Chem    6 non-null      int64
 4   Math    6 non-null      int64
dtypes: datetime64[ns](1), int64(4)
memory usage: 368.0 bytes

In [27]:
df['Date'] = pd.to_datetime(df['Date'])

In [28]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Date    6 non-null      datetime64[ns]
 1   RID     6 non-null      int64
 2   Phy     6 non-null      int64
 3   Chem    6 non-null      int64
 4   Math    6 non-null      int64
dtypes: datetime64[ns](1), int64(4)
memory usage: 368.0 bytes

In [32]:
df['month'] = df['Date'].dt.month

In [54]:
df = df.sort_values(by='month',axis=0)
df

        Date  RID  Phy  Chem  Math  month
4 2020-02-13  813   22    24    43      2
5 2015-06-09  853   17    61    42      6
2 2015-09-07  375    1    32    68      9
0 2015-12-06  498   22    52    63     12
1 2011-12-27  721   45    56    37     12
3 2012-12-21  464   65    50    62     12

In [34]:
count = df['month'].value_counts().to_frame().reset_index()

In [35]:
count

   index  month
0     12      3
1      9      1
2      2      1
3      6      1

In [36]:
num = count['index'].iloc[0]
num

12

In [49]:
df1 = df[df['month']==num]

In [50]:
df1

        Date  RID  Phy  Chem  Math  month
0 2015-12-06  498   22    52    63     12
1 2011-12-27  721   45    56    37     12
3 2012-12-21  464   65    50    62     12

In [51]:
df1['Date'].dt.month_name().iloc[0][:3].upper()

'DEC'

In [45]:
count['month'].iloc[0]

3

In [220]:
df1['Phy'].mean()

44.0

In [210]:
df1['Chem'].mean()

52.666666666666664

In [211]:
df1['Math'].mean()

54.0

In [223]:
arr = ['DEC',1,2,3]

In [225]:
pd.Series([arr])

0    [DEC, 1, 2, 3]
dtype: object